# =============================================================================
# macos/Brewfile  —  Homebrew bundle
# Run: brew bundle --file=~/dotfiles/macos/Brewfile
# =============================================================================

# ---- CLI tools --------------------------------------------------------------
brew "chezmoi"           # dotfiles manager
brew "git"               # version control
brew "git-delta"         # syntax-highlighted diffs
brew "gh"                # GitHub CLI
brew "curl"              # HTTP client
brew "wget"              # file downloader
brew "jq"                # JSON processor
brew "yq"                # YAML processor
brew "fzf"               # fuzzy finder
brew "ripgrep"           # fast grep (rg)
brew "eza"               # modern ls replacement
brew "bat"               # cat with syntax highlighting
brew "fd"                # fast find replacement
brew "tmux"              # terminal multiplexer
brew "starship"          # cross-shell prompt
brew "zsh"               # Zsh shell
brew "tree"              # directory tree viewer
brew "htop"              # process monitor
brew "nvm"               # Node version manager
brew "openssh"           # SSH client
brew "gnupg"             # GPG
brew "pinentry-mac"      # GPG passphrase GUI for macOS
brew "git-lfs"           # Git Large File Storage
brew "pnpm"              # pnpm package manager
brew "age"               # modern encryption (chezmoi)
brew "make"              # build tool

# ---- Dev tools --------------------------------------------------------------
brew "shellcheck"        # shell script linter
brew "shfmt"             # shell script formatter
brew "hadolint"          # Dockerfile linter

# ---- macOS apps (casks) -----------------------------------------------------
cask "ghostty"
cask "font-jetbrains-mono-nerd-font"
# Uncomment and add casks as needed:
# cask "iterm2"
# cask "visual-studio-code"
# cask "docker"
# cask "1password"
